import { useNavigate } from "react-router-dom";
import "./Rhlaa.css";
import animationData2 from "../img/Love is blind.json";  // اختر صورة مناسبة من عندك
import Lottie from "lottie-react";

export default function Rhlaa() {
  const navigate = useNavigate();
useEffect(() => {
  setTimeout(() => {
    if (scrollRef.current) {
      scrollRef.current.scrollTop = -100;
    }
  }, 50); // 50ms كافية في الغالب
}, []);


  // هنا حط 100 جملة حب وصفات شخصية احلام
  const arr = [
  "احبك",
  "اعشقك",
  "مجنونة بس على مزاجي",
  "ضحكتك تداوي",
  "عيونك حكاية لوحدها",
  "بحبك زي ما انتي",
  "قلبك أبيض",
  "أموت في خفة دمك",
  "وجودك مريح",
  "صوتك يطمني",
  "بحب هدوءك",
  "وبحب جنانك",
  "عيونك بتكلم",
  "حنيتك نعمة",
  "ضحكتك بتغير يومي",
  "بحس بالأمان معاكي",
  "قريبة من قلبي",
  "مش محتاجة تتغيري",
  "بحبك بعيوبك",
  "وبحبك بمميزاتك",
  "نظرتك تكسف",
  "قلبك طيب زيادة عن اللزوم",
  "أحب هزارك",
  "وأحب زعلك برضه",
  "لما تضحكي بنسى الدنيا",
  "عيونك مريحة",
  "قلبك حنين",
  "روحك حلوة",
  "كلك على بعضك جميل",
  "وجودك فرق",
  "ضحكتك نعمة من ربنا",
  "بحب تفاصيلك",
  "حتى سكوتك بحبه",
  "كلامك بيدخل القلب",
  "نظرتك بتلخبطني",
  "قريبة لروحي",
  "مش بعرف أزعل منك",
  "بحب طريقتك",
  "عفويتك حلوة",
  "قلبك نضيف",
  "بتفهميني من غير كلام",
  "نفسك طويل",
  "حنونتي",
  "دلعك عاجبني",
  "ضحكتك أمان",
  "بحس إني نفسي معاكي",
  "مريحة",
  "قلبك دافي",
  "وجودك نعمة",
  "قريبة من قلبي قوي",
  "بحب ضحكتك من قلبك",
  "طلتك حلوة",
  "عيونك صادقة",
  "مش شبه حد",
  "مميزة",
  "خفيفة على القلب",
  "ربنا ما يحرمنيش منك",
  "بحبك بجد",
  "بحبك من غير شروط",
  "اختلافك حلو",
  "حضورك ملفت",
  "قلبك يستاهل الحب",
  "ضحكتك بتفوقني",
  "بتطمني",
  "بحبك على طبيعتك",
  "عيونك فيها أمان",
  "روحك قريبة",
  "قلبك كبير",
  "مش محتاج غيرك",
  "كفاية وجودك",
  "بحبك أكتر ما أقول",
  "قلبك ناعم",
  "ضحكتك حياة",
  "بحبك يا أحلام ❤️"
];

  return (
    <div className="body2">
      <div className="romantice" data-aos="fade-up" data-aos-anchor-placement="top-bottom">
        {arr.map((item, index) => (
          <p key={index} data-aos="fade-up">
            {index + 1}. {item}
          </p>
        ))}

        <h2>خلصنا</h2>
        <button onClick={() => navigate("/Rhlaa")}>
          💖 بحبك   (يارب تعجبك)
        </button>
              <Lottie
        className="loveu"
        animationData={animationData2}
        loop={true}
        style={{ width: 160 }}
      />
      </div>
    </div>
  );
}
